; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   grey_block_1 brown_block_1 purple_block_1 yellow_block_1 grey_block_2 yellow_block_2 purple_block_2 - block
 )
 (:init (ontable grey_block_1) (on brown_block_1 grey_block_1) (ontable purple_block_1) (on yellow_block_1 purple_block_1) (on grey_block_2 brown_block_1) (on yellow_block_2 yellow_block_1) (ontable purple_block_2) (clear grey_block_2) (clear yellow_block_2) (clear purple_block_2) (handempty) (= (total-cost) 0))
 (:goal (and (on yellow_block_1 brown_block_1)))
 (:constraints (sometime (and (on purple_block_1 brown_block_1) (on grey_block_2 grey_block_1))))
 (:metric minimize (total-cost))
)

; plan
1. (unstack yellow_block_2 yellow_block_1)
   deleted: (on yellow_block_2 yellow_block_1) (clear yellow_block_2) (handempty)
   added: (holding yellow_block_2) (clear yellow_block_1)
   goals met: 0 of 1
2. (putdown yellow_block_2)
   deleted: (holding yellow_block_2)
   added: (clear yellow_block_2) (handempty) (ontable yellow_block_2)
   goals met: 0 of 1
3. (unstack yellow_block_1 purple_block_1)
   deleted: (on yellow_block_1 purple_block_1) (clear yellow_block_1) (handempty)
   added: (holding yellow_block_1) (clear purple_block_1)
   goals met: 0 of 1
4. (putdown yellow_block_1)
   deleted: (holding yellow_block_1)
   added: (clear yellow_block_1) (handempty) (ontable yellow_block_1)
   goals met: 0 of 1
5. (unstack grey_block_2 brown_block_1)
   deleted: (on grey_block_2 brown_block_1) (clear grey_block_2) (handempty)
   added: (holding grey_block_2) (clear brown_block_1)
   goals met: 0 of 1
6. (putdown grey_block_2)
   deleted: (holding grey_block_2)
   added: (clear grey_block_2) (handempty) (ontable grey_block_2)
   goals met: 0 of 1
7. (unstack brown_block_1 grey_block_1)
   deleted: (on brown_block_1 grey_block_1) (clear brown_block_1) (handempty)
   added: (holding brown_block_1) (clear grey_block_1)
   goals met: 0 of 1
8. (putdown brown_block_1)
   deleted: (holding brown_block_1)
   added: (clear brown_block_1) (handempty) (ontable brown_block_1)
   goals met: 0 of 1
9. (pickup purple_block_1)
   deleted: (clear purple_block_1) (ontable purple_block_1) (handempty)
   added: (holding purple_block_1)
   goals met: 0 of 1
10. (stack purple_block_1 brown_block_1)
   deleted: (clear brown_block_1) (holding purple_block_1)
   added: (handempty) (clear purple_block_1) (on purple_block_1 brown_block_1)
   goals met: 0 of 1
11. (pickup grey_block_2)
   deleted: (clear grey_block_2) (ontable grey_block_2) (handempty)
   added: (holding grey_block_2)
   goals met: 0 of 1
12. (stack grey_block_2 grey_block_1)
   deleted: (clear grey_block_1) (holding grey_block_2)
   added: (handempty) (clear grey_block_2) (on grey_block_2 grey_block_1)
   goals met: 0 of 1
13. (unstack purple_block_1 brown_block_1)
   deleted: (on purple_block_1 brown_block_1) (clear purple_block_1) (handempty)
   added: (holding purple_block_1) (clear brown_block_1)
   goals met: 0 of 1
14. (putdown purple_block_1)
   deleted: (holding purple_block_1)
   added: (clear purple_block_1) (handempty) (ontable purple_block_1)
   goals met: 0 of 1
15. (pickup yellow_block_1)
   deleted: (clear yellow_block_1) (ontable yellow_block_1) (handempty)
   added: (holding yellow_block_1)
   goals met: 0 of 1
16. (stack yellow_block_1 brown_block_1)
   deleted: (clear brown_block_1) (holding yellow_block_1)
   added: (handempty) (clear yellow_block_1) (on yellow_block_1 brown_block_1)
   goals met: 1 of 1
